app/Views/layout/admin/v_footer.php

<?php
$db = \Config\Database::connect();
$konten = $db->table('konten')->get()->getRowArray();
$user = $db->table('user')->where(
  'id_user',
  session()->get('id_user')
)->join(
  "level",
  "level.id_level=user.level"
)->get()->getRowArray();
---
SELECT *
FROM `konten`
SELECT *
FROM `user`
JOIN `level` ON `level`.`id_level`=`user`.`level`
WHERE `id_user` = '1'