app/Views/layout/admin/v_header.php

<?php
$db = \Config\Database::connect();
$user = $db->table('user')->where(
    'id_user',
    session()->get('id_user')
)->join(
    "level",
    "level.id_level=user.level"
)->get()->getRowArray();
---
SELECT *
FROM `user`
JOIN `level` ON `level`.`id_level`=`user`.`level`
WHERE `id_user` = '1'