app/Views/layout/admin/v_nav.php

SELECT *
FROM `user`
WHERE `id_user` = '1'
---
<aside class="main-sidebar sidebar-dark-primary elevation-4">
    <?php
    $db = \Config\Database::connect();
    $user = $db->table('user')->where(
        'id_user',
        session()->get('id_user')
    )->get()->getRowArray();