app/Controllers/Users.php

    public function index()
    {
        $current_page = $this->request->getVar('page_user') ? $this->request->getVar('page_user') : 1;
        $keyword = $this->request->getGet('keyword');
        // if ($keyword) {
        //     $users = $this->m_user->search($keyword);
        // } else {
        //     $users = $this->m_user;
        // }
        $data = $this->m_user->getPaginate(7, $keyword);
        $data['menu'] = 'users';
        $data['submenu'] = 'datauser';
        $data['head'] = 'Data Alumni';
        $data['title'] = 'Data Alumni';
        $data['isi'] = 'main/admin/users';
        $data['detail'] = $this->m_user->tampildata();
        $data['currentPage'] = $current_page;
        $data['tampilfakultas'] = $this->m_fakultas->orderBy('nama_fakultas', 'ASC')->findAll();
---
SELECT *
FROM `tbl_fakultas`
ORDER BY `nama_fakultas` ASC

    public function delete($id_user)
    {
        $db = \Config\Database::connect();
        $user = $db->table('user')->where('id_user', $id_user)->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `id_user` = '41'