app/Models/ModelAdmin.php

SELECT COUNT(*) AS `numrows` FROM `tbl_question`
---
    function TotalQuestion()
    {
        return $this->db->table('tbl_question')->countAll();