app/Models/ModelKonten.php

SELECT *
FROM `konten`
---
    function tampil_data()
    {
        return $this->db->table('konten')->get()->getRowArray();