app/Models/ModelUsers.php

SELECT *
FROM `user`
JOIN `tbl_fakultas` ON `tbl_fakultas`.`id_fakultas`=`user`.`kode_fakultas`
JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi`=`user`.`kode_prodi`
WHERE `status` = 'approved'
ORDER BY `tahun_lulus`
---
    function tampildata()
    {
        return $this->db->table('user')->join(
            "tbl_fakultas",
            "tbl_fakultas.id_fakultas=user.kode_fakultas",
        )->join(
            "tbl_prodi",
            "tbl_prodi.id_prodi=user.kode_prodi",
        )->where('status=', 'approved')->orderBy('tahun_lulus', SORT_DESC)->get()->getResultArray();

DELETE FROM `user`
WHERE `id_user` = '41'
---
    function delete_data($id_user)
    {
        return $this->db->table('user')->delete(array('id_user' => $id_user));